program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "2.1.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.2"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<string, []> var_68_pad_type_0 = const()[name = tensor<string, []>("op_68_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_68_pad_0 = const()[name = tensor<string, []>("op_68_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_68_strides_0 = const()[name = tensor<string, []>("op_68_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_68_dilations_0 = const()[name = tensor<string, []>("op_68_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_68_groups_0 = const()[name = tensor<string, []>("op_68_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1024, 80, 3]> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, [1024, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1024]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(491648)))];
            tensor<fp16, [1, 80, 3000]> logmel_data_to_fp16 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data)[name = tensor<string, []>("cast_100")];
            tensor<fp16, [1, 1024, 3000]> var_68_cast_fp16 = conv(bias = const_1_to_fp16, dilations = var_68_dilations_0, groups = var_68_groups_0, pad = var_68_pad_0, pad_type = var_68_pad_type_0, strides = var_68_strides_0, weight = const_0_to_fp16, x = logmel_data_to_fp16)[name = tensor<string, []>("op_68_cast_fp16")];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1024, 3000]> input_1_cast_fp16 = gelu(mode = input_1_mode_0, x = var_68_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_86_pad_type_0 = const()[name = tensor<string, []>("op_86_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_86_pad_0 = const()[name = tensor<string, []>("op_86_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_86_strides_0 = const()[name = tensor<string, []>("op_86_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_86_dilations_0 = const()[name = tensor<string, []>("op_86_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_86_groups_0 = const()[name = tensor<string, []>("op_86_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 3]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [1024, 1024, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(493760)))];
            tensor<fp16, [1024]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6785280)))];
            tensor<fp16, [1, 1024, 1500]> var_86_cast_fp16 = conv(bias = const_3_to_fp16, dilations = var_86_dilations_0, groups = var_86_groups_0, pad = var_86_pad_0, pad_type = var_86_pad_type_0, strides = var_86_strides_0, weight = const_2_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_86_cast_fp16")];
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1024, 1500]> x_3_cast_fp16 = gelu(mode = x_3_mode_0, x = var_86_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [1024, 1500]> var_91_to_fp16 = const()[name = tensor<string, []>("op_91_to_fp16"), val = tensor<fp16, [1024, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6787392)))];
            tensor<fp16, [1, 1024, 1500]> var_93_cast_fp16 = add(x = x_3_cast_fp16, y = var_91_to_fp16)[name = tensor<string, []>("op_93_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1024, 1, 1500]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_93_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_108 = const()[name = tensor<string, []>("op_108"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_3_axes_0 = const()[name = tensor<string, []>("input_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1024]> input_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_3_gamma_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9859456)))];
            tensor<fp16, [1024]> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9861568)))];
            tensor<fp16, []> var_124_to_fp16 = const()[name = tensor<string, []>("op_124_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1024, 1, 1500]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_0, beta = input_3_beta_0_to_fp16, epsilon = var_124_to_fp16, gamma = input_3_gamma_0_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_1_strides_0 = const()[name = tensor<string, []>("q_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_1_dilations_0 = const()[name = tensor<string, []>("q_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_1_groups_0 = const()[name = tensor<string, []>("q_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> var_159_weight_0_to_fp16 = const()[name = tensor<string, []>("op_159_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9863680)))];
            tensor<fp16, [1024]> var_159_bias_0_to_fp16 = const()[name = tensor<string, []>("op_159_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11960896)))];
            tensor<fp16, [1, 1024, 1, 1500]> var_159_cast_fp16 = conv(bias = var_159_bias_0_to_fp16, dilations = q_1_dilations_0, groups = q_1_groups_0, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = q_1_strides_0, weight = var_159_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_159_cast_fp16")];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_1_strides_0 = const()[name = tensor<string, []>("k_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_1_dilations_0 = const()[name = tensor<string, []>("k_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_1_groups_0 = const()[name = tensor<string, []>("k_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11963008)))];
            tensor<fp16, [1, 1024, 1, 1500]> k_1_cast_fp16 = conv(dilations = k_1_dilations_0, groups = k_1_groups_0, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = k_1_strides_0, weight = blocks_0_attn_key_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<string, []> var_157_pad_type_0 = const()[name = tensor<string, []>("op_157_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_157_strides_0 = const()[name = tensor<string, []>("op_157_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_157_pad_0 = const()[name = tensor<string, []>("op_157_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_157_dilations_0 = const()[name = tensor<string, []>("op_157_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_157_groups_0 = const()[name = tensor<string, []>("op_157_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14060224)))];
            tensor<fp16, [1024]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16157440)))];
            tensor<fp16, [1, 1024, 1, 1500]> var_157_cast_fp16 = conv(bias = blocks_0_attn_value_bias_to_fp16, dilations = var_157_dilations_0, groups = var_157_groups_0, pad = var_157_pad_0, pad_type = var_157_pad_type_0, strides = var_157_strides_0, weight = blocks_0_attn_value_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_157_cast_fp16")];
            tensor<int32, [16]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [16]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_160_axis_0 = const()[name = tensor<string, []>("op_160_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_160_cast_fp16_15 = split(axis = var_160_axis_0, split_sizes = tile_0, x = var_159_cast_fp16)[name = tensor<string, []>("op_160_cast_fp16")];
            tensor<int32, [4]> var_177_perm_0 = const()[name = tensor<string, []>("op_177_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [16]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [16]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_178_axis_0 = const()[name = tensor<string, []>("op_178_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 1024]> var_177_cast_fp16 = transpose(perm = var_177_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_7, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_8, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_9, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_10, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_11, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_12, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_13, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_14, tensor<fp16, [1, 1500, 1, 64]> var_178_cast_fp16_15 = split(axis = var_178_axis_0, split_sizes = tile_1, x = var_177_cast_fp16)[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<int32, [16]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [16]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_195_axis_0 = const()[name = tensor<string, []>("op_195_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_195_cast_fp16_15 = split(axis = var_195_axis_0, split_sizes = tile_2, x = var_157_cast_fp16)[name = tensor<string, []>("op_195_cast_fp16")];
            tensor<string, []> aw_1_equation_0 = const()[name = tensor<string, []>("aw_1_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_1_cast_fp16 = einsum(equation = aw_1_equation_0, values = (var_178_cast_fp16_0, var_160_cast_fp16_0))[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<string, []> aw_3_equation_0 = const()[name = tensor<string, []>("aw_3_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_3_cast_fp16 = einsum(equation = aw_3_equation_0, values = (var_178_cast_fp16_1, var_160_cast_fp16_1))[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<string, []> aw_5_equation_0 = const()[name = tensor<string, []>("aw_5_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_5_cast_fp16 = einsum(equation = aw_5_equation_0, values = (var_178_cast_fp16_2, var_160_cast_fp16_2))[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<string, []> aw_7_equation_0 = const()[name = tensor<string, []>("aw_7_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_7_cast_fp16 = einsum(equation = aw_7_equation_0, values = (var_178_cast_fp16_3, var_160_cast_fp16_3))[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<string, []> aw_9_equation_0 = const()[name = tensor<string, []>("aw_9_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_9_cast_fp16 = einsum(equation = aw_9_equation_0, values = (var_178_cast_fp16_4, var_160_cast_fp16_4))[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<string, []> aw_11_equation_0 = const()[name = tensor<string, []>("aw_11_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_11_cast_fp16 = einsum(equation = aw_11_equation_0, values = (var_178_cast_fp16_5, var_160_cast_fp16_5))[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<string, []> aw_13_equation_0 = const()[name = tensor<string, []>("aw_13_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_13_cast_fp16 = einsum(equation = aw_13_equation_0, values = (var_178_cast_fp16_6, var_160_cast_fp16_6))[name = tensor<string, []>("aw_13_cast_fp16")];
            tensor<string, []> aw_15_equation_0 = const()[name = tensor<string, []>("aw_15_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_15_cast_fp16 = einsum(equation = aw_15_equation_0, values = (var_178_cast_fp16_7, var_160_cast_fp16_7))[name = tensor<string, []>("aw_15_cast_fp16")];
            tensor<string, []> aw_17_equation_0 = const()[name = tensor<string, []>("aw_17_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_17_cast_fp16 = einsum(equation = aw_17_equation_0, values = (var_178_cast_fp16_8, var_160_cast_fp16_8))[name = tensor<string, []>("aw_17_cast_fp16")];
            tensor<string, []> aw_19_equation_0 = const()[name = tensor<string, []>("aw_19_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_19_cast_fp16 = einsum(equation = aw_19_equation_0, values = (var_178_cast_fp16_9, var_160_cast_fp16_9))[name = tensor<string, []>("aw_19_cast_fp16")];
            tensor<string, []> aw_21_equation_0 = const()[name = tensor<string, []>("aw_21_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_21_cast_fp16 = einsum(equation = aw_21_equation_0, values = (var_178_cast_fp16_10, var_160_cast_fp16_10))[name = tensor<string, []>("aw_21_cast_fp16")];
            tensor<string, []> aw_23_equation_0 = const()[name = tensor<string, []>("aw_23_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_23_cast_fp16 = einsum(equation = aw_23_equation_0, values = (var_178_cast_fp16_11, var_160_cast_fp16_11))[name = tensor<string, []>("aw_23_cast_fp16")];
            tensor<string, []> aw_25_equation_0 = const()[name = tensor<string, []>("aw_25_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_25_cast_fp16 = einsum(equation = aw_25_equation_0, values = (var_178_cast_fp16_12, var_160_cast_fp16_12))[name = tensor<string, []>("aw_25_cast_fp16")];
            tensor<string, []> aw_27_equation_0 = const()[name = tensor<string, []>("aw_27_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_27_cast_fp16 = einsum(equation = aw_27_equation_0, values = (var_178_cast_fp16_13, var_160_cast_fp16_13))[name = tensor<string, []>("aw_27_cast_fp16")];
            tensor<string, []> aw_29_equation_0 = const()[name = tensor<string, []>("aw_29_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_29_cast_fp16 = einsum(equation = aw_29_equation_0, values = (var_178_cast_fp16_14, var_160_cast_fp16_14))[name = tensor<string, []>("aw_29_cast_fp16")];
            tensor<string, []> aw_31_equation_0 = const()[name = tensor<string, []>("aw_31_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_31_cast_fp16 = einsum(equation = aw_31_equation_0, values = (var_178_cast_fp16_15, var_160_cast_fp16_15))[name = tensor<string, []>("aw_31_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_244_cast_fp16 = softmax(axis = var_108, x = aw_1_cast_fp16)[name = tensor<string, []>("op_244_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_245_cast_fp16 = softmax(axis = var_108, x = aw_3_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_246_cast_fp16 = softmax(axis = var_108, x = aw_5_cast_fp16)[name = tensor<string, []>("op_246_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_247_cast_fp16 = softmax(axis = var_108, x = aw_7_cast_fp16)[name = tensor<string, []>("op_247_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_248_cast_fp16 = softmax(axis = var_108, x = aw_9_cast_fp16)[name = tensor<string, []>("op_248_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_249_cast_fp16 = softmax(axis = var_108, x = aw_11_cast_fp16)[name = tensor<string, []>("op_249_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_250_cast_fp16 = softmax(axis = var_108, x = aw_13_cast_fp16)[name = tensor<string, []>("op_250_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_251_cast_fp16 = softmax(axis = var_108, x = aw_15_cast_fp16)[name = tensor<string, []>("op_251_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_252_cast_fp16 = softmax(axis = var_108, x = aw_17_cast_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_253_cast_fp16 = softmax(axis = var_108, x = aw_19_cast_fp16)[name = tensor<string, []>("op_253_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_254_cast_fp16 = softmax(axis = var_108, x = aw_21_cast_fp16)[name = tensor<string, []>("op_254_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_255_cast_fp16 = softmax(axis = var_108, x = aw_23_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_256_cast_fp16 = softmax(axis = var_108, x = aw_25_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_257_cast_fp16 = softmax(axis = var_108, x = aw_27_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_258_cast_fp16 = softmax(axis = var_108, x = aw_29_cast_fp16)[name = tensor<string, []>("op_258_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_259_cast_fp16 = softmax(axis = var_108, x = aw_31_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<string, []> var_261_equation_0 = const()[name = tensor<string, []>("op_261_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_261_cast_fp16 = einsum(equation = var_261_equation_0, values = (var_195_cast_fp16_0, var_244_cast_fp16))[name = tensor<string, []>("op_261_cast_fp16")];
            tensor<string, []> var_263_equation_0 = const()[name = tensor<string, []>("op_263_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_263_cast_fp16 = einsum(equation = var_263_equation_0, values = (var_195_cast_fp16_1, var_245_cast_fp16))[name = tensor<string, []>("op_263_cast_fp16")];
            tensor<string, []> var_265_equation_0 = const()[name = tensor<string, []>("op_265_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_265_cast_fp16 = einsum(equation = var_265_equation_0, values = (var_195_cast_fp16_2, var_246_cast_fp16))[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<string, []> var_267_equation_0 = const()[name = tensor<string, []>("op_267_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_267_cast_fp16 = einsum(equation = var_267_equation_0, values = (var_195_cast_fp16_3, var_247_cast_fp16))[name = tensor<string, []>("op_267_cast_fp16")];
            tensor<string, []> var_269_equation_0 = const()[name = tensor<string, []>("op_269_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_269_cast_fp16 = einsum(equation = var_269_equation_0, values = (var_195_cast_fp16_4, var_248_cast_fp16))[name = tensor<string, []>("op_269_cast_fp16")];
            tensor<string, []> var_271_equation_0 = const()[name = tensor<string, []>("op_271_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_271_cast_fp16 = einsum(equation = var_271_equation_0, values = (var_195_cast_fp16_5, var_249_cast_fp16))[name = tensor<string, []>("op_271_cast_fp16")];
            tensor<string, []> var_273_equation_0 = const()[name = tensor<string, []>("op_273_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16 = einsum(equation = var_273_equation_0, values = (var_195_cast_fp16_6, var_250_cast_fp16))[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<string, []> var_275_equation_0 = const()[name = tensor<string, []>("op_275_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_275_cast_fp16 = einsum(equation = var_275_equation_0, values = (var_195_cast_fp16_7, var_251_cast_fp16))[name = tensor<string, []>("op_275_cast_fp16")];
            tensor<string, []> var_277_equation_0 = const()[name = tensor<string, []>("op_277_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_277_cast_fp16 = einsum(equation = var_277_equation_0, values = (var_195_cast_fp16_8, var_252_cast_fp16))[name = tensor<string, []>("op_277_cast_fp16")];
            tensor<string, []> var_279_equation_0 = const()[name = tensor<string, []>("op_279_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_279_cast_fp16 = einsum(equation = var_279_equation_0, values = (var_195_cast_fp16_9, var_253_cast_fp16))[name = tensor<string, []>("op_279_cast_fp16")];
            tensor<string, []> var_281_equation_0 = const()[name = tensor<string, []>("op_281_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_281_cast_fp16 = einsum(equation = var_281_equation_0, values = (var_195_cast_fp16_10, var_254_cast_fp16))[name = tensor<string, []>("op_281_cast_fp16")];
            tensor<string, []> var_283_equation_0 = const()[name = tensor<string, []>("op_283_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_283_cast_fp16 = einsum(equation = var_283_equation_0, values = (var_195_cast_fp16_11, var_255_cast_fp16))[name = tensor<string, []>("op_283_cast_fp16")];
            tensor<string, []> var_285_equation_0 = const()[name = tensor<string, []>("op_285_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_285_cast_fp16 = einsum(equation = var_285_equation_0, values = (var_195_cast_fp16_12, var_256_cast_fp16))[name = tensor<string, []>("op_285_cast_fp16")];
            tensor<string, []> var_287_equation_0 = const()[name = tensor<string, []>("op_287_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_287_cast_fp16 = einsum(equation = var_287_equation_0, values = (var_195_cast_fp16_13, var_257_cast_fp16))[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<string, []> var_289_equation_0 = const()[name = tensor<string, []>("op_289_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_289_cast_fp16 = einsum(equation = var_289_equation_0, values = (var_195_cast_fp16_14, var_258_cast_fp16))[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<string, []> var_291_equation_0 = const()[name = tensor<string, []>("op_291_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_291_cast_fp16 = einsum(equation = var_291_equation_0, values = (var_195_cast_fp16_15, var_259_cast_fp16))[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1024, 1, 1500]> input_5_cast_fp16 = concat(axis = var_108, interleave = input_5_interleave_0, values = (var_261_cast_fp16, var_263_cast_fp16, var_265_cast_fp16, var_267_cast_fp16, var_269_cast_fp16, var_271_cast_fp16, var_273_cast_fp16, var_275_cast_fp16, var_277_cast_fp16, var_279_cast_fp16, var_281_cast_fp16, var_283_cast_fp16, var_285_cast_fp16, var_287_cast_fp16, var_289_cast_fp16, var_291_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> var_300_pad_type_0 = const()[name = tensor<string, []>("op_300_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_300_strides_0 = const()[name = tensor<string, []>("op_300_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_300_pad_0 = const()[name = tensor<string, []>("op_300_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_300_dilations_0 = const()[name = tensor<string, []>("op_300_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_300_groups_0 = const()[name = tensor<string, []>("op_300_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16159552)))];
            tensor<fp16, [1024]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18256768)))];
            tensor<fp16, [1, 1024, 1, 1500]> var_300_cast_fp16 = conv(bias = blocks_0_attn_out_bias_to_fp16, dilations = var_300_dilations_0, groups = var_300_groups_0, pad = var_300_pad_0, pad_type = var_300_pad_type_0, strides = var_300_strides_0, weight = blocks_0_attn_out_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("op_300_cast_fp16")];
            tensor<fp16, [1, 1024, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = var_300_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1024]> input_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_7_gamma_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18258880)))];
            tensor<fp16, [1024]> input_7_beta_0_to_fp16 = const()[name = tensor<string, []>("input_7_beta_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18260992)))];
            tensor<fp16, []> var_310_to_fp16 = const()[name = tensor<string, []>("op_310_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1024, 1, 1500]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = input_7_beta_0_to_fp16, epsilon = var_310_to_fp16, gamma = input_7_gamma_0_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [4096, 1024, 1, 1]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [4096, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18263104)))];
            tensor<fp16, [4096]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26651776)))];
            tensor<fp16, [1, 4096, 1, 1500]> input_9_cast_fp16 = conv(bias = blocks_0_mlp_0_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = blocks_0_mlp_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 4096, 1, 1500]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> var_336_pad_type_0 = const()[name = tensor<string, []>("op_336_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_336_strides_0 = const()[name = tensor<string, []>("op_336_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_336_pad_0 = const()[name = tensor<string, []>("op_336_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_336_dilations_0 = const()[name = tensor<string, []>("op_336_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_336_groups_0 = const()[name = tensor<string, []>("op_336_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 4096, 1, 1]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [1024, 4096, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26660032)))];
            tensor<fp16, [1024]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35048704)))];
            tensor<fp16, [1, 1024, 1, 1500]> var_336_cast_fp16 = conv(bias = blocks_0_mlp_2_bias_to_fp16, dilations = var_336_dilations_0, groups = var_336_groups_0, pad = var_336_pad_0, pad_type = var_336_pad_type_0, strides = var_336_strides_0, weight = blocks_0_mlp_2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("op_336_cast_fp16")];
            tensor<fp16, [1, 1024, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = var_336_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_345 = const()[name = tensor<string, []>("op_345"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1024]> input_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_13_gamma_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35050816)))];
            tensor<fp16, [1024]> input_13_beta_0_to_fp16 = const()[name = tensor<string, []>("input_13_beta_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35052928)))];
            tensor<fp16, []> var_361_to_fp16 = const()[name = tensor<string, []>("op_361_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1024, 1, 1500]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = input_13_beta_0_to_fp16, epsilon = var_361_to_fp16, gamma = input_13_gamma_0_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_3_strides_0 = const()[name = tensor<string, []>("q_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_3_dilations_0 = const()[name = tensor<string, []>("q_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_3_groups_0 = const()[name = tensor<string, []>("q_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> var_396_weight_0_to_fp16 = const()[name = tensor<string, []>("op_396_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35055040)))];
            tensor<fp16, [1024]> var_396_bias_0_to_fp16 = const()[name = tensor<string, []>("op_396_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37152256)))];
            tensor<fp16, [1, 1024, 1, 1500]> var_396_cast_fp16 = conv(bias = var_396_bias_0_to_fp16, dilations = q_3_dilations_0, groups = q_3_groups_0, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = q_3_strides_0, weight = var_396_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_396_cast_fp16")];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_3_strides_0 = const()[name = tensor<string, []>("k_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_3_dilations_0 = const()[name = tensor<string, []>("k_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_3_groups_0 = const()[name = tensor<string, []>("k_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37154368)))];
            tensor<fp16, [1, 1024, 1, 1500]> k_3_cast_fp16 = conv(dilations = k_3_dilations_0, groups = k_3_groups_0, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = k_3_strides_0, weight = blocks_1_attn_key_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<string, []> var_394_pad_type_0 = const()[name = tensor<string, []>("op_394_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_394_strides_0 = const()[name = tensor<string, []>("op_394_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_394_pad_0 = const()[name = tensor<string, []>("op_394_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_394_dilations_0 = const()[name = tensor<string, []>("op_394_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_394_groups_0 = const()[name = tensor<string, []>("op_394_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1024, 1024, 1, 1]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [1024, 1024, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39251584)))];
            tensor<fp16, [1024]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41348800)))];
            tensor<fp16, [1, 1024, 1, 1500]> var_394_cast_fp16 = conv(bias = blocks_1_attn_value_bias_to_fp16, dilations = var_394_dilations_0, groups = var_394_groups_0, pad = var_394_pad_0, pad_type = var_394_pad_type_0, strides = var_394_strides_0, weight = blocks_1_attn_value_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_394_cast_fp16")];
            tensor<int32, [16]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [16]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_397_axis_0 = const()[name = tensor<string, []>("op_397_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_397_cast_fp16_15 = split(axis = var_397_axis_0, split_sizes = tile_3, x = var_396_cast_fp16)[name = tensor<string, []>("op_397_cast_fp16")];
            tensor<int32, [4]> var_414_perm_0 = const()[name = tensor<string, []>("op_414_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [16]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [16]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_415_axis_0 = const()[name = tensor<string, []>("op_415_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 1024]> var_414_cast_fp16 = transpose(perm = var_414_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_7, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_8, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_9, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_10, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_11, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_12, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_13, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_14, tensor<fp16, [1, 1500, 1, 64]> var_415_cast_fp16_15 = split(axis = var_415_axis_0, split_sizes = tile_4, x = var_414_cast_fp16)[name = tensor<string, []>("op_415_cast_fp16")];
            tensor<int32, [16]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [16]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_432_axis_0 = const()[name = tensor<string, []>("op_432_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16_15 = split(axis = var_432_axis_0, split_sizes = tile_5, x = var_394_cast_fp16)[name = tensor<string, []>("op_432_cast_fp16")];
            tensor<string, []> aw_33_equation_0 = const()[name = tensor<string, []>("aw_33_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_33_cast_fp16 = einsum(equation = aw_33_equation_0, values = (var_415_cast_fp16_0, var_397_cast_fp16_0))[name = tensor<string, []>("aw_33_cast_fp16")];
            tensor<string, []> aw_35_equation_0 = const()[name = tensor<string, []>("aw_35_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_35_cast_fp16 = einsum(equation = aw_35_equation_0, values = (var_415_cast_fp16_1, var_397_cast_fp16_1))[name = tensor<string, []>("aw_35_cast_fp16")];
            tensor<string, []> aw_37_equation_0 = const()[name = tensor<string, []>("aw_37_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_37_cast_fp16 = einsum(equation = aw_37_equation_0, values = (var_415_cast_fp16_2, var_397_cast_fp16_2))[name = tensor<string, []>("aw_37_cast_fp16")];
            tensor<string, []> aw_39_equation_0 = const()[name = tensor<string, []>("aw_39_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_39_cast_fp16 = einsum(equation = aw_39_equation_0, values = (var_415_cast_fp16_3, var_397_cast_fp16_3))[name = tensor<string, []>("aw_39_cast_fp16")];
            tensor<string, []> aw_41_equation_0 = const()[name = tensor<string, []>("aw_41_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_41_cast_fp16 = einsum(equation = aw_41_equation_0, values = (var_415_cast_fp16_4, var_397_cast_fp16_4))[name = tensor<string, []>("aw_41_cast_fp16")];
            tensor<string, []> aw_43_equation_0 = const()[name = tensor<string, []>("aw_43_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_43_cast_fp16 = einsum(equation = aw_43_equation_0, values = (var_415_cast_fp16_5, var_397_cast_fp16_5))[name = tensor<string, []>("aw_43_cast_fp16")];
            tensor<string, []> aw_45_equation_0 = const()[name = tensor<string, []>("aw_45_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_45_cast_fp16 = einsum(equation = aw_45_equation_0, values = (var_415_cast_fp16_6, var_397_cast_fp16_6))[name = tensor<string, []>("aw_45_cast_fp16")];
            tensor<string, []> aw_47_equation_0 = const()[name = tensor<string, []>("aw_47_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_47_cast_fp16 = einsum(equation = aw_47_equation_0, values = (var_415_cast_fp16_7, var_397_cast_fp16_7))[name = tensor<string, []>("aw_47_cast_fp16")];
            tensor<string, []> aw_49_equation_0 = const()[name = tensor<string, []>("aw_49_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_49_cast_fp16 = einsum(equation = aw_49_equation_0, values = (var_415_cast_fp16_8, var_397_cast_fp16_8))[name = tensor<string, []>("aw_49_cast_fp16")];
            tensor<string, []> aw_51_equation_0 = const()[name = tensor<string, []>("aw_51_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_51_cast_fp16 = einsum(equation = aw_51_equation_0, values = (var_415_cast_fp16_9, var_397_cast_fp16_9))[name = tensor<string, []>("aw_51_cast_fp16")];
            tensor<string, []> aw_53_equation_0 = const()[name = tensor<string, []>("aw_53_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_53_cast_fp16 = einsum(equation = aw_53_equation_0, values = (var_415_cast_fp16_10, var_397_cast_fp16_10))[name = tensor<string, []>("aw_53_cast_fp16")];
            tensor<string, []> aw_55_equation_0 = const()[name = tensor<string, []>("aw_55_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_55_cast_fp16 = einsum(equation = aw_55_equation_0, values = (var_415_cast_fp16_11, var_397_cast_fp16_11))[name = tensor<string, []>("aw_55_cast_fp16")];
            tensor<string, []> aw_57_equation_0 = const()[name = tensor<string, []>("aw_57_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
